## Plan Result (Aks_prod - DeployInfrastructure)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 6 to change, 2 to destroy.</code></pre>

* Update
  * module.kubernetes[&#34;00&#34;].azapi_resource.service_operator_credential
  * module.kubernetes[&#34;00&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[&#34;00&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting_sa[0]
  * module.kubernetes[&#34;01&#34;].azapi_resource.service_operator_credential
  * module.kubernetes[&#34;01&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[&#34;01&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting_sa[0]
* Replace
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.kubernetes["00"].azapi_resource.service_operator_credential will be updated in-place
  ~ resource "azapi_resource" "service_operator_credential" {
        id                        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-prod-mi/federatedIdentityCredentials/cft-prod-00-aks"
        name                      = "cft-prod-00-aks"
      + removing_special_chars    = false
        tags                      = {}
        # (8 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled       = false -> null
      - enable_host_encryption        = false -> null
      - enable_node_public_ip         = false -> null
      - fips_enabled                  = false -> null
      ~ id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-prod-00-aks/agentPools/linux" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ max_count                     = 100 -> 4
      ~ min_count                     = 30 -> 2
        name                          = "linux"
      ~ node_count                    = 39 -> (known after apply)
      ~ node_labels                   = {} -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ vm_size                       = "Standard_D8ds_v5" -> "Standard_DS3_v2" # forces replacement
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
        id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-prod-00-aks|DiagLogAnalytics"
        name                           = "DiagLogAnalytics"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (16 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting_sa" {
        id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-prod-00-aks|aks-storage"
        name                           = "aks-storage"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (12 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azapi_resource.service_operator_credential will be updated in-place
  ~ resource "azapi_resource" "service_operator_credential" {
        id                        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-prod-mi/federatedIdentityCredentials/cft-prod-01-aks"
        name                      = "cft-prod-01-aks"
      + removing_special_chars    = false
        tags                      = {}
        # (8 unchanged attributes hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled       = false -> null
      - enable_host_encryption        = false -> null
      - enable_node_public_ip         = false -> null
      - fips_enabled                  = false -> null
      ~ id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-prod-01-aks/agentPools/linux" -> (known after apply)
      ~ kubelet_disk_type             = "OS" -> (known after apply)
      ~ max_count                     = 100 -> 4
      ~ min_count                     = 30 -> 2
        name                          = "linux"
      ~ node_count                    = 38 -> (known after apply)
      ~ node_labels                   = {} -> (known after apply)
      ~ os_disk_size_gb               = 128 -> (known after apply)
      ~ os_sku                        = "Ubuntu" -> (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
      ~ vm_size                       = "Standard_D8ds_v5" -> "Standard_DS3_v2" # forces replacement
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
        id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-prod-01-aks|DiagLogAnalytics"
        name                           = "DiagLogAnalytics"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (16 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting_sa" {
        id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-prod-01-aks|aks-storage"
        name                           = "aks-storage"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (12 unchanged blocks hidden)
    }

Plan: 2 to add, 6 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":678,"Program":"tfcmt","SHA1":"","Target":"Aks_prod - DeployInfrastructure","Vars":{}} -->